{
  "cut": "The haircut appears to be a long, one-length cut with minimal layering. The perimeter is likely blunt, creating a solid, even line at the ends. There is no visible graduation or stacking, indicating a classic, straightforward cutting technique. The overall shape is simple and elongated, emphasizing length and smoothness.",
  "length": "Mid-back length",
  "layers": "The hair has very subtle layering, if any, primarily focused on removing bulk rather than creating significant volume or movement. The layers are likely long and blended, maintaining the overall length and density of the hair. The layering is likely achieved with point-cutting or slide-cutting techniques to soften the edges and prevent a harsh, blunt line. This minimal layering allows the hair to maintain its sleek, uniform appearance.",
  "texture": "The hair appears to have a naturally straight texture that has been styled for a sleek and polished finish. The strands are smooth and aligned, indicating the use of heat styling tools such as a flat iron. There is no visible frizz or flyaways, suggesting the application of smoothing serums or oils. The ends are also straight and smooth, maintaining the overall polished appearance.",
  "volume": "Flat at roots with some body through the mid-lengths and ends",
  "parting": "Center part",
  "front_styling": "The front is styled with a clean center part and no bangs. The hair falls smoothly along the sides of the face, framing it softly. There are no visible face-framing layers or shorter pieces, maintaining the sleek and uniform appearance of the style.",
  "overall_style": "This is a classic, elegant hairstyle characterized by its long length, sleek texture, and simple silhouette. The style emphasizes smoothness and shine, creating a polished and refined look. The overall aesthetic is understated and timeless, suitable for formal occasions or everyday wear.",
  "_metadata": {
    "preset_id": "26207ed4-3307-4269-8851-9e1df8eafc28",
    "display_name": "Heian"
  }
}