{
  "cut": "This is a disconnected undercut with significant length on top. The sides and back are closely cropped, creating a sharp contrast with the longer hair on top of the head. The perimeter of the undercut is clean and precise, following the natural hairline. The top section appears to be left at a medium length, allowing for versatile styling options.",
  "length": "Chin-length",
  "layers": "The hair features subtle layering on the longer top section to add movement and texture. The layers are concentrated towards the ends, creating a softer edge and preventing the style from appearing too heavy. The layering is minimal to maintain the overall length and density of the top section. This layering technique allows for the hair to be styled in various ways, such as adding volume or creating a more tousled look.",
  "texture": "The hair appears to have a naturally straight texture that has been styled for a slightly tousled finish. The ends have a slightly piecey texture, suggesting the use of a texturizing product. The overall texture is smooth with a hint of natural wave. The style does not appear overly polished, giving it a more relaxed and effortless vibe.",
  "volume": "Slight lift at the roots with volume through the mid-lengths.",
  "parting": "Deep side part on the left.",
  "front_styling": "The front is styled with a deep side part, allowing the hair to fall across the forehead and frame the face. There are no defined bangs, but the longer pieces create a soft, face-framing effect. The front pieces are styled with a slight bend away from the face, adding movement and softness to the overall look.",
  "overall_style": "This is a modern, edgy style that combines a disconnected undercut with a longer, textured top section. The style is versatile and can be adapted to suit different hair types and personal preferences. The overall aesthetic is cool and confident, with a touch of rebellious flair.",
  "_metadata": {
    "preset_id": "5aa28bd8-b6f2-4951-b727-5afe8e99d24a",
    "display_name": "Cyberpunk"
  }
}