{
  "cut": "This is a long layered haircut designed to maintain length while adding movement and volume. The perimeter is soft and slightly rounded, avoiding a blunt or harsh line. Interior layering is used to remove weight and encourage the hair to fall in a cascading manner. The cut incorporates long layers throughout, starting around the face and blending seamlessly into the longer lengths, creating a soft and flowing silhouette.",
  "length": "Long",
  "layers": "The hair features long, flowing layers that start around the face and cascade down the length of the hair. These layers are designed to add movement and volume without sacrificing length. The layering technique involves a combination of point-cutting and slide-cutting to create soft, seamless transitions between layers. The graduation is subtle, creating a natural and effortless look that enhances the hair's overall texture and body.",
  "texture": "The hair appears to have a naturally wavy texture that has been enhanced with styling. The waves are soft and flowing, creating a romantic and feminine look. The hair has been styled with a curling iron or wand to create defined waves, and a texturizing spray may have been used to add volume and hold. The ends are soft and slightly piece-y, adding to the overall texture and movement of the style.",
  "volume": "Full and voluminous throughout",
  "parting": "Off-center part",
  "front_styling": "The front is styled with soft, face-framing layers that blend seamlessly into the longer lengths. These layers are designed to accentuate the face and add movement to the style. The front pieces are styled with a slight bend away from the face, creating a soft and flattering frame. There are no bangs present, allowing the forehead to be fully visible.",
  "overall_style": "This is a classic and elegant long wavy hairstyle, perfect for formal events or special occasions. The style features soft, flowing waves, a voluminous silhouette, and a romantic and feminine aesthetic. The hair is styled with a curling iron or wand to create defined waves, and a texturizing spray may have been used to add volume and hold. The overall look is polished and refined, making it a timeless and versatile choice.",
  "_metadata": {
    "preset_id": "8eb5e289-ddd2-4320-861c-6fcee39d679b",
    "display_name": "Beauty Queen"
  }
}